var areas = {
    "110100":
        [
            {
                "city": "市辖区",
                "name": "东城区",
                "id": "110101"
            },
            {
                "city": "市辖区",
                "name": "西城区",
                "id": "110102"
            }
        ],
    "120100":
        [
            {
                "city": "市辖区",
                "name": "红桥区",
                "id": "120101"
            },
            {
                "city": "市辖区",
                "name": "和平区",
                "id": "120102"
            }
        ]
}